; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-11 - location
	p1-5 - location
	p1-7 - location
	p1-14 - location
	p2-14 - location
	p3-2 - location
	p3-7 - location
	p3-10 - location
	p3-13 - location
	p4-10 - location
	p5-4 - location
	p5-13 - location
	p6-0 - location
	p6-3 - location
	p6-13 - location
	p7-11 - location
	p8-3 - location
	p8-9 - location
	p8-11 - location
	p9-12 - location
	p10-1 - location
	p10-8 - location
	p11-1 - location
	p11-6 - location
	p13-11 - location
	p14-5 - location
	p14-7 - location
	p14-10 - location
	p14-12 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s8)
	(at driver3 s4)
	(at driver4 s10)
	(at truck1 s10)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s11)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s13)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s0)
	(at package2 s3)
	(at package3 s7)
	(at package4 s3)
	(at package5 s6)
	(at package6 s10)
	(at package7 s12)
	(at package8 s1)
	(at package9 s12)
	(at package10 s8)
	(at package11 s7)
	(at package12 s1)
	(at package13 s6)
	(at package14 s11)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s1 p1-14)
	(path p1-14 s1)
	(path s14 p1-14)
	(path p1-14 s14)
	(path s2 p2-14)
	(path p2-14 s2)
	(path s14 p2-14)
	(path p2-14 s14)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s3 p3-13)
	(path p3-13 s3)
	(path s13 p3-13)
	(path p3-13 s13)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-13)
	(path p6-13 s6)
	(path s13 p6-13)
	(path p6-13 s13)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(path s9 p9-12)
	(path p9-12 s9)
	(path s12 p9-12)
	(path p9-12 s12)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-6)
	(path p11-6 s11)
	(path s6 p11-6)
	(path p11-6 s6)
	(path s13 p13-11)
	(path p13-11 s13)
	(path s11 p13-11)
	(path p13-11 s11)
	(path s14 p14-5)
	(path p14-5 s14)
	(path s5 p14-5)
	(path p14-5 s5)
	(path s14 p14-7)
	(path p14-7 s14)
	(path s7 p14-7)
	(path p14-7 s7)
	(path s14 p14-10)
	(path p14-10 s14)
	(path s10 p14-10)
	(path p14-10 s10)
	(path s14 p14-12)
	(path p14-12 s14)
	(path s12 p14-12)
	(path p14-12 s12)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 11)
	(= (time-to-drive s4 s0) 11)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 30)
	(= (time-to-drive s10 s0) 30)
	(link s0 s13)
	(link s13 s0)
	(= (time-to-drive s0 s13) 94)
	(= (time-to-drive s13 s0) 94)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 78)
	(= (time-to-drive s0 s1) 78)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 11)
	(= (time-to-drive s10 s1) 11)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 92)
	(= (time-to-drive s12 s1) 92)
	(link s1 s14)
	(link s14 s1)
	(= (time-to-drive s1 s14) 15)
	(= (time-to-drive s14 s1) 15)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 85)
	(= (time-to-drive s3 s2) 85)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 57)
	(= (time-to-drive s8 s2) 57)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 87)
	(= (time-to-drive s10 s2) 87)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 5)
	(= (time-to-drive s11 s2) 5)
	(link s2 s14)
	(link s14 s2)
	(= (time-to-drive s2 s14) 75)
	(= (time-to-drive s14 s2) 75)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 28)
	(= (time-to-drive s7 s3) 28)
	(link s3 s14)
	(link s14 s3)
	(= (time-to-drive s3 s14) 41)
	(= (time-to-drive s14 s3) 41)
	(link s4 s13)
	(link s13 s4)
	(= (time-to-drive s4 s13) 53)
	(= (time-to-drive s13 s4) 53)
	(link s4 s14)
	(link s14 s4)
	(= (time-to-drive s4 s14) 27)
	(= (time-to-drive s14 s4) 27)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 15)
	(= (time-to-drive s1 s5) 15)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 77)
	(= (time-to-drive s2 s5) 77)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 45)
	(= (time-to-drive s11 s5) 45)
	(link s5 s14)
	(link s14 s5)
	(= (time-to-drive s5 s14) 30)
	(= (time-to-drive s14 s5) 30)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 3)
	(= (time-to-drive s0 s6) 3)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 39)
	(= (time-to-drive s1 s6) 39)
	(link s6 s13)
	(link s13 s6)
	(= (time-to-drive s6 s13) 96)
	(= (time-to-drive s13 s6) 96)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 80)
	(= (time-to-drive s0 s7) 80)
	(link s7 s12)
	(link s12 s7)
	(= (time-to-drive s7 s12) 66)
	(= (time-to-drive s12 s7) 66)
	(link s7 s14)
	(link s14 s7)
	(= (time-to-drive s7 s14) 37)
	(= (time-to-drive s14 s7) 37)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 21)
	(= (time-to-drive s0 s8) 21)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 9)
	(= (time-to-drive s1 s8) 9)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 57)
	(= (time-to-drive s9 s8) 57)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 69)
	(= (time-to-drive s0 s9) 69)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 1)
	(= (time-to-drive s1 s9) 1)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 67)
	(= (time-to-drive s2 s9) 67)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 98)
	(= (time-to-drive s3 s9) 98)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 94)
	(= (time-to-drive s4 s9) 94)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 44)
	(= (time-to-drive s6 s9) 44)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 9)
	(= (time-to-drive s7 s9) 9)
	(link s9 s14)
	(link s14 s9)
	(= (time-to-drive s9 s14) 86)
	(= (time-to-drive s14 s9) 86)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 58)
	(= (time-to-drive s1 s11) 58)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 94)
	(= (time-to-drive s3 s11) 94)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 43)
	(= (time-to-drive s6 s11) 43)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 45)
	(= (time-to-drive s4 s12) 45)
	(link s13 s1)
	(link s1 s13)
	(= (time-to-drive s13 s1) 98)
	(= (time-to-drive s1 s13) 98)
	(link s13 s5)
	(link s5 s13)
	(= (time-to-drive s13 s5) 18)
	(= (time-to-drive s5 s13) 18)
	(link s13 s12)
	(link s12 s13)
	(= (time-to-drive s13 s12) 73)
	(= (time-to-drive s12 s13) 73)
	(link s14 s0)
	(link s0 s14)
	(= (time-to-drive s14 s0) 39)
	(= (time-to-drive s0 s14) 39)
	(link s14 s12)
	(link s12 s14)
	(= (time-to-drive s14 s12) 70)
	(= (time-to-drive s12 s14) 70)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at truck2 s7)
	(at truck3 s12)
	(at truck4 s1)
	(at package1 s1)
	(at package2 s12)
	(at package3 s1)
	(at package4 s9)
	(at package5 s14)
	(at package6 s9)
	(at package7 s5)
	(at package8 s13)
	(at package10 s8)
	(at package11 s8)
	(at package13 s4)
	(at package14 s8)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 16
2. (drive-truck truck2 s8 s0 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 210
   goals met: 1 of 16
3. (load-truck package1 truck2 s0)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 16
4. (drive-truck truck2 s0 s8 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (fuel-used) from 210 to 441
   goals met: 1 of 16
5. (walk driver1 s4 p4-10)
   deleted: (at driver1 s4)
   added: (at driver1 p4-10)
   goals met: 1 of 16
6. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 441 to 540
   goals met: 1 of 16
7. (drive-truck truck2 s1 s6 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 540 to 969
   goals met: 1 of 16
8. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 16
9. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 969 to 1476
   goals met: 1 of 16
10. (walk driver1 p4-10 s10)
   deleted: (at driver1 p4-10)
   added: (at driver1 s10)
   goals met: 1 of 16
11. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 16
12. (drive-truck truck2 s1 s11 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s11)
   changed: (fuel-used) from 1476 to 2114
   goals met: 2 of 16
13. (load-truck package6 truck1 s10)
   deleted: (at package6 s10)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 16
14. (load-truck package14 truck2 s11)
   deleted: (at package14 s11)
   added: (in package14 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 16
15. (drive-truck truck2 s11 s6 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s6)
   changed: (fuel-used) from 2114 to 2673
   goals met: 2 of 16
16. (load-truck package13 truck2 s6)
   deleted: (at package13 s6)
   added: (in package13 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 16
17. (unload-truck package6 truck1 s10)
   deleted: (in package6 truck1)
   added: (at package6 s10)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 16
18. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2673 to 3297
   goals met: 2 of 16
19. (load-truck package8 truck2 s1)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 2 of 16
20. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 3297 to 3597
   goals met: 2 of 16
21. (board-truck driver1 truck1 s10)
   deleted: (at driver1 s10) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 16
22. (drive-truck truck2 s5 s13 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s13)
   changed: (fuel-used) from 3597 to 3957
   goals met: 2 of 16
23. (load-truck package6 truck1 s10)
   deleted: (at package6 s10)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 16
24. (drive-truck truck1 s10 s0 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s0)
   changed: (fuel-used) from 3957 to 4287
   goals met: 2 of 16
25. (drive-truck truck2 s13 s12 driver2)
   deleted: (at truck2 s13)
   added: (at truck2 s12)
   changed: (fuel-used) from 4287 to 5747
   goals met: 2 of 16
26. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 3 of 16
27. (walk driver1 s0 p0-11)
   deleted: (at driver1 s0)
   added: (at driver1 p0-11)
   goals met: 2 of 16
28. (load-truck package7 truck2 s12)
   deleted: (at package7 s12)
   added: (in package7 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 2 of 16
29. (unload-truck package6 truck1 s0)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 16
30. (drive-truck truck2 s12 s4 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s4)
   changed: (fuel-used) from 5747 to 6872
   goals met: 2 of 16
31. (unload-truck package13 truck2 s4)
   deleted: (in package13 truck2)
   added: (at package13 s4)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 3 of 16
32. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 6872 to 7092
   goals met: 3 of 16
33. (load-truck package6 truck2 s0)
   deleted: (at package6 s0)
   added: (in package6 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 16
34. (drive-truck truck2 s0 s9 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (fuel-used) from 7092 to 8817
   goals met: 3 of 16
35. (unload-truck package6 truck2 s9)
   deleted: (in package6 truck2)
   added: (at package6 s9)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 4 of 16
36. (drive-truck truck2 s9 s7 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s7)
   changed: (fuel-used) from 8817 to 8997
   goals met: 5 of 16
37. (drive-truck truck2 s7 s12 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s12)
   changed: (fuel-used) from 8997 to 10317
   goals met: 4 of 16
38. (walk driver1 p0-11 s11)
   deleted: (at driver1 p0-11)
   added: (at driver1 s11)
   goals met: 4 of 16
39. (board-truck driver1 truck3 s11)
   deleted: (at driver1 s11) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 16
40. (drive-truck truck3 s11 s1 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s1)
   changed: (fuel-used) from 10317 to 10897
   goals met: 4 of 16
41. (drive-truck truck2 s12 s14 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s14)
   changed: (fuel-used) from 10897 to 12297
   goals met: 4 of 16
42. (drive-truck truck3 s1 s13 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s13)
   changed: (fuel-used) from 12297 to 13277
   goals met: 4 of 16
43. (unload-truck package5 truck2 s14)
   deleted: (in package5 truck2)
   added: (at package5 s14)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 5 of 16
44. (drive-truck truck2 s14 s7 driver2)
   deleted: (at truck2 s14)
   added: (at truck2 s7)
   changed: (fuel-used) from 13277 to 13869
   goals met: 6 of 16
45. (load-truck package3 truck2 s7)
   deleted: (at package3 s7)
   added: (in package3 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 6 of 16
46. (load-truck package11 truck2 s7)
   deleted: (at package11 s7)
   added: (in package11 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 6 of 16
47. (drive-truck truck2 s7 s14 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s14)
   changed: (fuel-used) from 13869 to 14794
   goals met: 5 of 16
48. (drive-truck truck2 s14 s1 driver2)
   deleted: (at truck2 s14)
   added: (at truck2 s1)
   changed: (fuel-used) from 14794 to 15169
   goals met: 5 of 16
49. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 16
50. (drive-truck truck3 s13 s0 driver1)
   deleted: (at truck3 s13)
   added: (at truck3 s0)
   changed: (fuel-used) from 15169 to 16109
   goals met: 6 of 16
51. (drive-truck truck3 s0 s9 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s9)
   changed: (fuel-used) from 16109 to 16799
   goals met: 6 of 16
52. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 16799 to 17099
   goals met: 6 of 16
53. (unload-truck package7 truck2 s5)
   deleted: (in package7 truck2)
   added: (at package7 s5)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 7 of 16
54. (drive-truck truck2 s5 s13 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s13)
   changed: (fuel-used) from 17099 to 17387
   goals met: 7 of 16
55. (unload-truck package8 truck2 s13)
   deleted: (in package8 truck2)
   added: (at package8 s13)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 8 of 16
56. (drive-truck truck2 s13 s0 driver2)
   deleted: (at truck2 s13)
   added: (at truck2 s0)
   changed: (fuel-used) from 17387 to 18609
   goals met: 8 of 16
57. (drive-truck truck3 s9 s0 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s0)
   changed: (fuel-used) from 18609 to 19299
   goals met: 8 of 16
58. (drive-truck truck3 s0 s14 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s14)
   changed: (fuel-used) from 19299 to 19689
   goals met: 8 of 16
59. (drive-truck truck2 s0 s8 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (fuel-used) from 19689 to 19962
   goals met: 8 of 16
60. (unload-truck package14 truck2 s8)
   deleted: (in package14 truck2)
   added: (at package14 s8)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 9 of 16
61. (unload-truck package11 truck2 s8)
   deleted: (in package11 truck2)
   added: (at package11 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 16
62. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 19962 to 20052
   goals met: 10 of 16
63. (drive-truck truck2 s1 s13 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s13)
   changed: (fuel-used) from 20052 to 21032
   goals met: 10 of 16
64. (disembark-truck driver2 truck2 s13)
   deleted: (driving driver2 truck2)
   added: (at driver2 s13) (empty truck2)
   goals met: 10 of 16
65. (drive-truck truck3 s14 s3 driver1)
   deleted: (at truck3 s14)
   added: (at truck3 s3)
   changed: (fuel-used) from 21032 to 21442
   goals met: 10 of 16
66. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 10 of 16
67. (load-truck package4 truck3 s3)
   deleted: (at package4 s3)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 10 of 16
68. (drive-truck truck3 s3 s9 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (fuel-used) from 21442 to 22716
   goals met: 10 of 16
69. (unload-truck package4 truck3 s9)
   deleted: (in package4 truck3)
   added: (at package4 s9)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 11 of 16
70. (drive-truck truck3 s9 s7 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (fuel-used) from 22716 to 22815
   goals met: 11 of 16
71. (drive-truck truck3 s7 s12 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s12)
   changed: (fuel-used) from 22815 to 23541
   goals met: 12 of 16
72. (unload-truck package2 truck3 s12)
   deleted: (in package2 truck3)
   added: (at package2 s12)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 16
73. (board-truck driver2 truck2 s13)
   deleted: (at driver2 s13) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 13 of 16
74. (disembark-truck driver1 truck3 s12)
   deleted: (driving driver1 truck3)
   added: (at driver1 s12) (empty truck3)
   goals met: 13 of 16
75. (drive-truck truck2 s13 s0 driver2)
   deleted: (at truck2 s13)
   added: (at truck2 s0)
   changed: (fuel-used) from 23541 to 24481
   goals met: 13 of 16
76. (drive-truck truck2 s0 s7 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   changed: (fuel-used) from 24481 to 25281
   goals met: 14 of 16
77. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 14 of 16
78. (board-truck driver1 truck3 s12)
   deleted: (at driver1 s12) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 16
79. (drive-truck truck3 s12 s13 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s13)
   changed: (fuel-used) from 25281 to 26011
   goals met: 13 of 16
80. (drive-truck truck3 s13 s0 driver1)
   deleted: (at truck3 s13)
   added: (at truck3 s0)
   changed: (fuel-used) from 26011 to 26951
   goals met: 13 of 16
81. (drive-truck truck3 s0 s14 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s14)
   changed: (fuel-used) from 26951 to 27341
   goals met: 13 of 16
82. (disembark-truck driver1 truck3 s14)
   deleted: (driving driver1 truck3)
   added: (at driver1 s14) (empty truck3)
   goals met: 13 of 16
83. (walk driver2 s7 p3-7)
   deleted: (at driver2 s7)
   added: (at driver2 p3-7)
   goals met: 13 of 16
84. (walk driver2 p3-7 s3)
   deleted: (at driver2 p3-7)
   added: (at driver2 s3)
   goals met: 13 of 16
85. (board-truck driver1 truck3 s14)
   deleted: (at driver1 s14) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 13 of 16
86. (walk driver2 s3 p3-13)
   deleted: (at driver2 s3)
   added: (at driver2 p3-13)
   goals met: 13 of 16
87. (walk driver2 p3-13 s13)
   deleted: (at driver2 p3-13)
   added: (at driver2 s13)
   goals met: 13 of 16
88. (board-truck driver2 truck4 s13)
   deleted: (at driver2 s13) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 13 of 16
89. (drive-truck truck3 s14 s12 driver1)
   deleted: (at truck3 s14)
   added: (at truck3 s12)
   changed: (fuel-used) from 27341 to 28041
   goals met: 14 of 16
90. (disembark-truck driver1 truck3 s12)
   deleted: (driving driver1 truck3)
   added: (at driver1 s12) (empty truck3)
   goals met: 14 of 16
91. (drive-truck truck4 s13 s0 driver2)
   deleted: (at truck4 s13)
   added: (at truck4 s0)
   changed: (fuel-used) from 28041 to 28981
   goals met: 14 of 16
92. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 14 of 16
93. (walk driver1 s12 p9-12)
   deleted: (at driver1 s12)
   added: (at driver1 p9-12)
   goals met: 14 of 16
94. (walk driver1 p9-12 s9)
   deleted: (at driver1 p9-12)
   added: (at driver1 s9)
   goals met: 14 of 16
95. (walk driver1 s9 p8-9)
   deleted: (at driver1 s9)
   added: (at driver1 p8-9)
   goals met: 14 of 16
96. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 14 of 16
97. (walk driver1 p8-9 s8)
   deleted: (at driver1 p8-9)
   added: (at driver1 s8)
   goals met: 14 of 16
98. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 28981 to 29761
   goals met: 15 of 16
99. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 15 of 16
100. (walk driver1 s8 p8-11)
   deleted: (at driver1 s8)
   added: (at driver1 p8-11)
   goals met: 15 of 16
101. (walk driver1 p8-11 s11)
   deleted: (at driver1 p8-11)
   added: (at driver1 s11)
   goals met: 15 of 16
102. (walk driver1 s11 p0-11)
   deleted: (at driver1 s11)
   added: (at driver1 p0-11)
   goals met: 15 of 16
103. (walk driver1 p0-11 s0)
   deleted: (at driver1 p0-11)
   added: (at driver1 s0)
   goals met: 16 of 16
